Revit 2027 API
PointCloudType.Scale Property
 The multiplier applied to the points in all instances of this point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Scale { get; set; }
Public Property Scale As Double
	Get
	Set
public:
property double Scale {
	double get ();
	void set (double value);
}
member Scale : float with get, set
Property Value
Double
Remarks
 Scale converts the units in which the coordinates of individual points of the point cloud are interpreted.
See Also
Reference
PointCloudType Class
Autodesk.Revit.DB Namespace